src/test/resources/stripe-events/payment_intent_processing.json

{
  "id": "evt_3T7PULRqnwyBFap61qfdBLPc",
  "object": "event",
  "api_version": "2026-01-28.clover",
  "created": 1772669402,
  "data": {
    "object": {
      "id": "pi_3T7PULRqnwyBFap61fkmmSCw",
      "object": "payment_intent",
      "amount": 999,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 999,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": {
        "allow_redirects": "always",
        "enabled": true
      },
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic_async",
      "client_secret": "pi_3T7PULRqnwyBFap61fkmmSCw_secret_lcDcIglDcmEGf98pbRfMsvrf5",
      "confirmation_method": "automatic",
      "created": 1772669401,
      "currency": "usd",
      "customer": "cus_U5aa57P36m2j7c",
      "customer_account": null,
      "description": "BASIC",
      "excluded_payment_method_types": null,
      "last_payment_error": null,
      "latest_charge": "ch_3T7PULRqnwyBFap61SLJQ049",
      "livemode": false,
      "metadata": {},
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_1T7POwRqnwyBFap6oR4O2g2j",
      "payment_method_configuration_details": {
        "id": "pmc_1SyqMDRqnwyBFap6oV7DUqmy",
        "parent": null
      },
      "payment_method_options": {
        "amazon_pay": {
          "express_checkout_element_session_id": null
        },
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        },
        "cashapp": {},
        "crypto": {},
        "klarna": {
          "preferred_locale": null
        },
        "link": {
          "persistent_token": null
        }
      },
      "payment_method_types": [
        "card",
        "klarna",
        "link",
        "cashapp",
        "amazon_pay",
        "crypto"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "processing",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_wcQGmakEtnzbHh",
    "idempotency_key": "c2367256-97bf-44b5-8118-f62c0b5e0f85"
  },
  "type": "payment_intent.processing"
}